[
    {
        "id": "1",
        "DayNumber": "1",
        "Photo": "./images/1suguina.JPG",
        "Location": "урочище Сугойна",
        "ShortDescription": "Отпарвная точка, тут мы пересели на лошадей.",
        "Description": "Здесь была наша база и отправная точка. Живописный ручей, баня перед походом и конечно знакомчтво с лошадями, на которых мы провели следующие дни."
    },
    {
        "id": "2",
        "DayNumber": "2",
        "Photo": "./images/2muehta.JPG",
        "Location": "урочище Муехта",
        "ShortDescription": "Живописные места, море зелени и вековые деревья.",
        "Description": "Находясь в этих местах, особенно на лошадях, начинаешь представлять себя ведьмаком из одноименного рассказа, начинаешь понимать прелести и трудности походной жизни."
    },
    {
        "id": "3",
        "DayNumber": "3",
        "Photo": "./images/3waterfall.JPG",
        "Location": "Водопад",
        "ShortDescription": "Потрязающий водопад с ледяной водой и крутым спуском.",
        "Description": "До водопада мы шли уже пешком, дав нашим лошадкам отдохнуть. Крутой и обрывистый спуск не испортил впечатление. И увидев такую красоту, мы поняли что все это не зря. Вода очень холодная - бррр."
    },
    {
        "id": "4",
        "DayNumber": "4",
        "Photo": "./images/4baioukskiy.JPG",
        "Location": "Байоюкский перевал",
        "ShortDescription": "Ради такой красоты стоит преодолеть тысячи километров.",
        "Description": "Под ногами камни и кусты, впереди горы и конечно облака - это же видели и люди сотни лет назад..."
    },
    {
        "id": "5",
        "DayNumber": "5",
        "Photo": "./images/5veronica.JPG",
        "Location": "озеро Вероника",
        "ShortDescription": "Существует легенда..., ну сами все узнаете, когда там побываете.",
        "Description": "Так вот легенда ... так, сами туда езжайте и все узнаете) Озеро холодное, но окунуться стоит."
    },
    {
        "id": "6",
        "DayNumber": "6",
        "Photo": "./images/6karakolskie.png",
        "Location": "Каракольские озера",
        "ShortDescription": "До озер мы так и не дошли, т.к. был сильный туман в тот день.",
        "Description": "Наш поход называллся Каракольские озера и основной целью было как раз посещение этих озер, но судьба распорядилась иначе. Зарядил такой туман, что ехать было опасно, тем более городским жителям, потеряться и заблудиться в таком тумане очень просто."
    },
    {
        "id": "7",
        "DayNumber": "7",
        "Photo": "./images/7kedrovaya.JPG",
        "Location": "Кедровая поляна",
        "ShortDescription": "Тут мы ночевали несколько ночей, на радость наших четвероногих друзей и нашу тоже.",
        "Description": "Наша дневка была на кедровой поляне. Десятки кедров, точнее кедровых сосен с массивными стволами добавляли эпичности данной местности."
    },
    {
        "id": "8",
        "DayNumber": "8",
        "Photo": "./images/8taezhnik.jpg",
        "Location": "эко-отель Таёжник",
        "ShortDescription": "Возвращение на базу, на берегу потрясающей реки Катунь.",
        "Description": "Закончилось наше путешествие. Немного грустно и много впечатлений. Жди нас Алтай снова!"
    }
]