// Остров Соловки 2023, solovki
const solovki23 = `[
    {
        "id": "1",
        "Photo": "./images/solovkiBut1.jpg",
        "ShortDescription": "Сейчас Соловки - это люди, живущие от навигации до навигации.",
        "Description": "Приехав сюда в первые, можно поразиться спокойствию и самобытности жизненному укладу людей, находящихся за многие километры от большой земли."
    },
    {
        "id": "2",
        "Photo": "./images/solovki2.jpg",
        "ShortDescription": "Красивый монастырь с темными подвалами.",
        "Description": "Этот потрясающий монастырь, сложенный из прибрежных камней величественной возвышается и демонстрирует свои белые стены."
    },
    {
        "id": "3",
        "Photo": "./images/solovkiMore3.jpg",
        "ShortDescription": "И конечно же Белое море, питаемое Северным Ледовитым Океаном.",
        "Description": "Море такое же бескрайнее как и небо, уходящее за горизонт. А близость Северного Ледовитого Океана придает данному месту еще более бескрайнее и величественное окружение."
    },
    {
        "id": "4",
        "Photo": "./images/solovkiLes4.jpg",
        "ShortDescription": "Хоть это и остров, но и там есть бескрайние леса и озера",
        "Description": "Смотря в даль и видя этот уходящий в горизонт лес совсем забываешь что находишься на острове."
    }
]`

export default solovki23;