export const myMotivation = [
    {
        title: 'Открытия',
        description: ', возможность открывать мир вокруг себя, даже прогулка пешком по тем местам, где ты кадый день проезжаешь на автомобиле или в автобусе, позволяет тебе открыть этиместа заново.'
    },
    {
        title: 'Осознание',
        description: ', возможность открывать мир вокруг себя, даже прогулка пешком по тем местам, где ты кадый день проезжаешь на автомобиле или в автобусе, позволяет тебе открыть этиместа заново.'
    },
    {
        title: 'Движение',
        description: ', постоянно находясь в движении, ты тренируешь свое тело и очищаешь разум. Ты начинаешь тренироваться сам, чтобы быть в тонусе, ты видишь результат и это вдохновляет тебя.'
    },
    {
        title: 'Знакомство',
        description: ' с новыми людьми, в походах ты встречаешь и узнаешь новых людей. Ты находишь людей, близких тебе по духу и взглядам. Некоторые из них становятся твоими друзьями, он все они оставляют свой след в твоей жизни, а ты в их.'
    }
]