export default function AltaiHorseTravelText() {
    return (
        <>
            После завершения основного похода, наш ждал еще один сюрприз - однодневный сплав на рафте по река Катунь. Немного изнеможденные, но еще сохранившие немного сил, мы с воодушевлением приняли это новое испытание и это было круто! Мы сплотились еще больше, мы были одним целым. До этого дня, я думал, что уже многое повидал на Алтае, но как оказалось это было еще не все. Бурлящие потоки, бочки и пороги, потрясающие горные вершины и лесистые берега, все радовало и в то же время не давало расслабится. В этом походе я нашел новых друзей, с которыми мы продолжили совместные путшествия.
        </>
    )
} 