export default function AltaiHorseTravelText() {
    return (
        <>
            Это был мой первый конный поход, а также первый мой визит на Алтай. Я
            очень рад, что начал свой знакомство с Алтаем имеено с конного похода,
            отдавая на откуп опытным лошадям эти тонкие и извилистые тропы, крытые
            спуски и долгие подъемы. Наш поход длился 8 дней и большую часть времени
            мы провели верхом на наших лошадках. Ночевали мы в палатках, что еще
            больше единило нас с природой. Но сопровождающие нас конюхи предпочитали
            спась вообще под окрытым небом, что повергало некоторых путешественноков,
            привыкших к комфортной жизни в городе в шок. Открывающиеся нашему взору
            горы, равнины, озера и реки говорили о своей первозданности, насколько это
            возможно в современном мире вблизи туристических маршрутах. Но то что я
            там увидел, я сохраню себе на всю свою жизнь!
        </>
    )
} 