export default function KareliaSplavChirkaKemText() {
    return (
        <>
            До этого у меня уже был опыт спалава на байдарках, поэтому нам дали двухместную байдарку без опутного инструктора. И это было не забываемо! Ежедневные преодоления порогов, языков и быстрин давали уверенности в своих силах. Неделя незабываемых приключений - потоки бурлящей воды, походная баня, рыбалка, самосплав, болота с морошкой и все это на фоне потрясающих видов нашей огромной страны.
            Встречались и местные, живущие в глуши и таком отдалении от цивилизации, что было завидно и непостижимо одновременно. Но все они были очень гостеприимны, ведь это основа выживания в таких местах - взаимопощь и выручка здесь на первом месте.
        </>
    )
} 