export default function KareliaKemText() {
    return (
        <>
            Я даже не представляю, при каких еще обстоятельствах я мог очутиться в этом городе, но имеено он был воротам и пропуском к нашему следующиму приключению. Сам город довольно неказист, много советсвикх построек, что отправляло на в прошлое - светлое и городое. Город начинает по-немногу оживать за счет туристических потоков. Здесь можно отведать вкусной рыбки, а в ресторане услышать фразу - эти продукты у нас уже закончились... Но в любом случае это было незабываемое ощущение - ощуенеи, что ты находишься практически на краю земли в тысячах километрах от дома и это все еще твоя страны. Ты понимаешь на сколько ты мал и на сколько огромен этот мир, хоть это его еще небольшая часть.
        </>
    )
}