export function AltaiHorseTravelText() {
    return (
        <>
            Это был мой первый конный поход, а также мой первый визит на Алтай. Я
            очень рад, что начал свое знакомство с Алтаем имеено с конного похода,
            отдавая на откуп опытным лошадям эти тонкие и извилистые тропы, крутые
            спуски и долгие подъемы. Наш поход длился 8 дней и большую часть времени
            мы провели верхом на наших лошадках. Ночевали мы в палатках, что еще
            больше единило нас с природой. А сопровождающие нас конюхи предпочитали
            спась вообще под окрытым небом, что повергало некоторых путешественников,
            привыкших к комфортной жизни в городе, в шок. Открывающиеся нашему взору
            горы, равнины, озера и реки говорили о своей первозданности, насколько это
            возможно в современном мире вблизи туристических маршрутов. И то, что я
            там увидел, я сохраню себе на всю жизнь!
        </>
    )
}

export function AltaiRaftingKatunText() {
    return (
        <>
            После завершения основного похода, нас ждал еще один сюрприз - однодневный сплав на рафте по реке Катунь. Немного изнеможденные, но еще сохранившие силы, мы с воодушевлением приняли это новое испытание и это было круто! Мы сплотились еще больше, мы были одним целым. До этого дня, я думал, что уже многое повидал на Алтае, но как оказалось это было еще не все. Бурлящие потоки, бочки и пороги, потрясающие горные вершины и лесистые берега, все радовало и в то же время не давало расслабиться. В этом походе я нашел новых друзей, с которыми мы продолжили совместные путшествия.
        </>
    )
}

export function KareliaSplavChirkaKemText() {
    return (
        <>
            До этого у меня уже был опыт сплава на байдарках, поэтому нам дали двухместную байдарку без опытного инструктора. И это было не забываемо! Ежедневные преодоления порогов, языков и быстрин давали уверенности в своих силах. Неделя незабываемых приключений - потоки бурлящей воды, походная баня, рыбалка, самосплав, болота с морошкой и все это на фоне потрясающих видов нашей огромной страны.
            Встречались и местные, живущие в глуши и таком отдалении от цивилизации, что было завидно и непостижимо одновременно. Но все они были очень гостеприимны, ведь это основа выживания в таких местах - взаимопощь и взаимовыручка здесь на первом месте.
        </>
    )
}

export function KareliaKemText() {
    return (
        <>
            Я даже не представляю, при каких еще обстоятельствах я мог очутиться в этом городе, но имеено он был воротам и пропуском к нашему следующиму приключению. Сам город довольно неказист, много советсвикх построек, что отправляло нас в прошлое - светлое и гордое. Город начинает по-немногу оживать за счет туристических потоков. Здесь можно отведать вкусной рыбки, а в ресторане услышать фразу - эти продукты у нас уже закончились, мы не сможем приготовить это блюдо на всех... Но в любом случае это было незабываемое ощущение - ощущение, что ты находишься практически на краю земли в тысячах километрах от дома и это все еще твоя страны. Ты понимаешь на сколько ты мал и на сколько огромен этот мир, хоть это его еще небольшая часть.
        </>
    )
}

export function Solovki23Text() {
    return (
        <>
            Это был первый в моей жизни реальный остров, на котором я побывал.
            Сейчас Соловки это прежде всего люди, живущие от навигации до навигации; это красивый монастырь, сложенный из прибрежных камней; это бескрайнее небо, как и то море, что его окружает.
            Находясь на острове, я невольно примерял жизнь его обитателей на себе. Жить в изоляции от большой земли, пусть и не постоянно, под силу не каждому. Но побывать там несомненно стоит! Всего два часа на пароме из Кеми и ты там. На острове развит прокат велосипедов, есть палаточный городок, есть гостиницы, много экскурсий.
            Сам остров достаточно большой и лучше выделить несколько дней. Туристов с каждым годом становится все больше, много паломников.
            Мы были там ближе к середине августа, вода в море по ощущениям +5С, хоть пляж и назывался Малибу, но инстинкт самосохранения искупаться не разрешил. Поэтому купальник можете не брать, если конечно вы не морж.
        </>
    )
}