export default function KareliaKemText() {
    return (
        <>
            Это был первый в моей жизни реальный остров, на котором я побывал.
            Сейчас Соловки это прежде всего люди, живущие от навигации до навигации; это красивый монастырь, сложенный из прибрежных камней; это бескрайнее небо, как и то море, что его окружает.
            Находясь на острове, я невольно примерял жизнь его обитателей на себе. Жить в изоляции от большой земли, пусть и не постоянно, под силу не каждому. Но побывать там несомненно стоит! Всего два часа на пароме из Кеми и ты там. На острове развит прокат велосипедов, есть палаточный городок, есть гостиницы, много экскурсий.
            Сам остров достаточно большой и лучше выделить несколько дней. Туристов с каждым годом становится все больше, много паломников.
            Мы были там ближе к середине августа, вода в море по ощущениям +5С, хоть пляж и назывался Малибу, но инстинкт самосохранения искупаться не разрешил. Поэтому купальник можете не брать, если конечно вы не морж.
        </>
    )
}